package org.leisureup.travel.internal.travel.domain;

import lombok.Getter;
import java.util.HashMap;
import java.util.Map;

@Getter
public enum RegionCode {
    백령도("백령도", "11A00101"),
    서울("서울", "11B10101"),
    과천("과천", "11B10102"),
    광명("광명", "11B10103"),
    강화("강화", "11B20101"),
    김포("김포", "11B20102"),
    인천("인천", "11B20201"),
    시흥("시흥", "11B20202"),
    안산("안산", "11B20203"),
    부천("부천", "11B20204"),
    의정부("의정부", "11B20301"),
    고양("고양", "11B20302"),
    양주("양주", "11B20304"),
    파주("파주", "11B20305"),
    동두천("동두천", "11B20401"),
    연천("연천", "11B20402"),
    포천("포천", "11B20403"),
    가평("가평", "11B20404"),
    구리("구리", "11B20501"),
    남양주("남양주", "11B20502"),
    양평("양평", "11B20503"),
    하남("하남", "11B20504"),
    수원("수원", "11B20601"),
    안양("안양", "11B20602"),
    오산("오산", "11B20603"),
    화성("화성", "11B20604"),
    성남("성남", "11B20605"),
    평택("평택", "11B20606"),
    의왕("의왕", "11B20609"),
    군포("군포", "11B20610"),
    안성("안성", "11B20611"),
    용인("용인", "11B20612"),
    이천("이천", "11B20701"),
    광주("광주", "11B20702"),
    여주("여주", "11B20703"),
    충주("충주", "11C10101"),
    진천("진천", "11C10102"),
    음성("음성", "11C10103"),
    제천("제천", "11C10201"),
    단양("단양", "11C10202"),
    청주("청주", "11C10301"),
    보은("보은", "11C10302"),
    괴산("괴산", "11C10303"),
    증평("증평", "11C10304"),
    추풍령("추풍령", "11C10401"),
    영동("영동", "11C10402"),
    옥천("옥천", "11C10403"),
    서산("서산", "11C20101"),
    태안("태안", "11C20102"),
    당진("당진", "11C20103"),
    홍성("홍성", "11C20104"),
    보령("보령", "11C20201"),
    서천("서천", "11C20202"),
    천안("천안", "11C20301"),
    아산("아산", "11C20302"),
    예산("예산", "11C20303"),
    대전("대전", "11C20401"),
    공주("공주", "11C20402"),
    계룡("계룡", "11C20403"),
    세종("세종", "11C20404"),
    부여("부여", "11C20501"),
    청양("청양", "11C20502"),
    금산("금산", "11C20601"),
    논산("논산", "11C20602"),
    철원("철원", "11D10101"),
    화천("화천", "11D10102"),
    인제("인제", "11D10201"),
    양구("양구", "11D10202"),
    춘천("춘천", "11D10301"),
    홍천("홍천", "11D10302"),
    원주("원주", "11D10401"),
    횡성("횡성", "11D10402"),
    영월("영월", "11D10501"),
    정선("정선", "11D10502"),
    평창("평창", "11D10503"),
    대관령("대관령", "11D20201"),
    태백("태백", "11D20301"),
    속초("속초", "11D20401"),
    고성("고성", "11D20402"),
    양양("양양", "11D20403"),
    강릉("강릉", "11D20501"),
    동해("동해", "11D20601"),
    삼척("삼척", "11D20602"),
    울릉도("울릉도", "11E00101"),
    독도("독도", "11E00102");

    private final String regionName;
    private final String regId;

    RegionCode(String regionName, String regId) {
        this.regionName = regionName;
        this.regId = regId;
    }

    private static final Map<String, RegionCode> BY_NAME = new HashMap<>();
    private static final Map<String, RegionCode> BY_CODE = new HashMap<>();
    static {
        for (RegionCode rc : values()) {
            BY_NAME.put(rc.regionName, rc);
            BY_CODE.put(rc.regId, rc);
        }
    }

    public static RegionCode fromRegionName(String regionName) {
        return BY_NAME.get(regionName);
    }

    public static RegionCode fromRegId(String regId) {
        return BY_CODE.get(regId);
    }
}
